Repository: ramasii/qbot_chat
Catalog: lib/l10n/app_*.arb
Languages: ar, id

# language
source: English
ar: العربية
id: Indonesia

source: OK
ar: موافق

source: Yes
ar: نعم
id: Ya

source: No
ar: لا
id: Tidak

source: Delete
ar: حذف
id: Hapus

source: Cancel
ar: إلغاء
id: Batal

source: Note
ar: ملاحظة
id: Catatan

# msgCopied
source: Messages copied
ar: تم نسخ الرسالة
id: Pesan disalin

source: Labels
ar: التصنيفات
id: Label

source: Menu
ar: القائمة

# upToPremium
source: Upgrade to Premium
ar: الترقية إلى بريميوم
id: Upgrade ke Premium

# setting
source: Settings
ar: الإعدادات
id: Pengaturan

# shareAllMsg
source: Share All Messages
ar: مشاركة جميع الرسائل
id: Bagikan Semua Pesan

# exportAllMsg
source: Export All Messages
ar: تصدير جميع الرسائل
id: Ekspor Semua Pesan

# importMsg
source: Import Messages
ar: استيراد الرسائل
id: Impor Pesan

# deleteAllMsg
source: Delete All Messages
ar: حذف جميع الرسائل
id: Hapus Semua Pesan

source: About IslamBot
ar: حول إسلام بوت
id: Tentang IslamBot

source: Exit App
ar: الخروج من التطبيق
id: Keluar Aplikasi

# textMsgHint
source: Try "Al-Baqarah 127"
ar: جرب "البقرة 127"
id: Coba "Al-Baqarah 127"

# scanningHint
source: Scanning process...
ar: جاري المسح...
id: Proses scanning...

# searchHint
source: Search...
ar: البحث...
id: Pencarian...

# willDltAllMsg
source: Delete all messages?
ar: هل تريد حذف جميع الرسائل؟
id: Hapus semua pesan?

# willDltThisMsg
source: Delete this message?
ar: هل تريد حذف هذه الرسالة؟
id: Hapus pesan ini?

# dltMsgConfrm
source: Deleted messages cannot be recovered.
ar: لا يمكن استعادة الرسائل المحذوفة.
id: Pesan yang dihapus tidak bisa dikembalikan.

# dontHvMsg
source: You don't have any Messages
ar: ليس لديك أي رسائل
id: Anda belum memiliki Pesan

source: Start Listening...
ar: بدء الاستماع...
id: Mulai Mendengarkan...

source: Stop Listening
ar: إيقاف الاستماع
id: Berhenti mendengarkan

# noteEmptyInfo
source: You haven't added any notes
ar: لم تقم بإضافة أي ملاحظات
id: Anda belum menambahkan catatan

source: Add Note
ar: إضافة ملاحظة
id: Tambah Catatan

# titleHint
source: Title
ar: العنوان
id: Judul

# noteContentHint
source: Enter your note...
ar: أدخل الملاحظة...
id: Masukkan catatan...

# titleDontEmpty
source: Title cannot be empty
ar: لا يمكن ترك العنوان فارغًا
id: Judul tidak boleh kosong

source: Note saved
ar: تم حفظ الملاحظة
id: Catatan disimpan

source: Added
ar: تمت الإضافة
id: Ditambahkan

source: Edited
ar: تم التعديل
id: Diedit

source: Edit
ar: تعديل

source: Copy Note
ar: نسخ الملاحظة
id: Salin Catatan

source: Share
ar: مشاركة
id: Bagikan

source: Save
ar: حفظ
id: Simpan

# labelInfo
source: Use labels to categorize messages. Tap and hold on a message to add a label.
ar: استخدم التصنيفات لتصنيف الرسائل. اضغط واستمر في الضغط على الرسالة لإضافة تصنيف.
id: Gunakan label untuk memilah pesan. Tekan dan tahan di pesan untuk memberi label.

source: Add Label
ar: إضافة تصنيف
id: Tambah Label

source: Add New Label
ar: إضافة تصنيف جديد
id: Tambah Label Baru

# newLabelHint
source: Enter label name
ar: أدخل اسم التصنيف
id: Masukkan nama label

# labelNameDontEmpty
source: Label name cannot be empty
ar: اسم التصنيف لا يمكن أن يكون فارغًا
id: Nama label tidak boleh kosong

# dltThisLbl
source: Delete this label?
ar: هل تريد حذف هذا التصنيف؟
id: Hapus label ini?

# dltLblConfrm
source: Deleted labels cannot be recovered, but messages will not be deleted.
ar: لا يمكن استعادة التصنيفات المحذوفة، ولكن الرسائل لن تحذف.
id: Label yang dihapus tidak bisa dikembalikan, namun pesan tidak akan terhapus

# labelEmpty
source: You haven't added any messages for this label
ar: لم تقم بإضافة أي رسائل لهذا التصنيف
id: Anda belum menambahkan pesan untuk label ini

source: Edit Label
ar: تعديل التصنيف

# dltLbl
source: Delete Label
ar: حذف التصنيف
id: Hapus Label

# editLblName
source: Edit Label Name
ar: تعديل اسم التصنيف
id: Edit Nama Label

# thisLblEmpty
source: This label has no messages
ar: هذا التصنيف لا يحتوي على رسائل
id: Label ini tidak memiliki pesan

source: Common
ar: عام
id: Umum

# languageA
source: Language
ar: اللغة
id: Bahasa

# slctLang
source: Select Language
ar: اختر اللغة
id: Pilih Bahasa

# autoTTS
source: Auto Start TTS
ar: تشغيل تلقائي للقراءة الصوتية

source: Font
ar: الخط

source: Regular Font Size
ar: حجم الخط العادي
id: Ukuran Font Latin

# slctRglrFontSize
source: Select Regular Font Size
ar: اختر حجم الخط العادي
id: Pilih Ukuran Font Latin

# arabFontSize
source: Arabic Font Size
ar: حجم الخط العربي
id: Ukuran Font Arab

# slctArabFontSize
source: Select Arabic Font Size
ar: اختر حجم الخط العربي
id: Pilih Ukuran Font Arab

# slctarabFont
source: Select Arabic Font
ar: اختر الخط العربي
id: Pilih Font Arab

source: Preview
ar: معاينة

# previewContent
source: **Al-Fatihah** (The Opening) Surah 1 Ayah **1** Juz 1 Page 1 بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ In the name of Allah, the Most Gracious, the Most Merciful.
ar: **الفاتحة** سورة رقم 1 آية رقم 1 جزء رقم 1 صفحة رقم 1 بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ باسم الله الرحمن الرحيم
id: **Al-Fatihah** (Pembukaan) surat ke 1 ayat **1** juz 1 halaman 1 بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيْمِ Dengan nama Allah Yang Maha Pengasih, Maha Penyayang.

# aboutUsContent
source: Thank you for using IslamBot, an Artificial Intelligence (AI) based chatbot that is ready to answer various questions related to Islam including Quran, Hadith, Fiqh, Sirah, various opinions of scholars, and more. If you encounter any issues with the IslamBot application, please contact us by providing the code and version name of the IslamBot you are using.
ar: شكرًا لاستخدام إسلام بوت، الشات بوت الذكاء الاصطناعي الذي يجاوب على مختلف الأسئلة المتعلقة بالإسلام بما في ذلك القرآن الكريم والحديث والفقه والسيرة النبوية وآراء العلماء وأكثر. إذا واجهت أي مشكلة في تطبيق إسلام بوت، يرجى التواصل معنا وتزويدنا برمز واسم الإصدار الذي تستخدمه من إسلام بوت.
id: Terima kasih telah menggunakan IslamBot, sebuah chatbot berbasis Artificial Intelligence (AI) yang siap menjawab berbagai pertanyaan terkait Islam mulai Al-Quran, Hadits, Fiqih, Sirah, berbagai keputusan ulama dan sebagainya. Jika Anda menemukan masalah di aplikasi IslamBot, silahkan hubungi kami dengan memberikan informasi kode dan nama versi IslamBot yang Anda gunakan.

# verCode
source: Version Code
ar: رمز الإصدار
id: Kode Versi

# verName
source: Version Name
ar: اسم الإصدار
id: Nama Versi

source: Connect With Us
ar: الاتصال بنا
id: Terhubung Dengan Kami

source: Contact Us
ar: تواصل معنا
id: Hubungi Kami

# islambotWeb
source: IslamBot Website
ar: موقع إسلام بوت
id: Website IslamBot

# instagramFoll
source: Follow Us on Instagram
ar: متابعتنا على انستغرام
id: Ikuti Kami di Instagram

# facebookFoll
source: Follow Us on Facebook
ar: متابعتنا على فيسبوك
id: Ikuti Kami di Facebook

# gPlayRate
source: Rate on Google Play
ar: تقييم على جوجل بلاي
id: Beri Rating di Google Play

# exitConfrm
source: Press again to exit the IslamBot application.
ar: اضغط مرة أخرى للخروج من تطبيق IslamBot
id: Tekan sekali lagi untuk keluar aplikasi IslamBot.

# labelMsg
source: Message Labels
ar: تصنيف الرسائل
id: Label Pesan

# savedOnInternal
source: Saved on internal memory
ar: حفظ في الذاكرة الداخلية
id: Disimpan di memori internal

# fileExportOnIntrnl
source: File successfully exported to internal memory
ar: تم تصدير الملف بنجاح إلى الذاكرة الداخلية
id: File berhasil diekspor di memori internal

source: Add to Note
ar: إضافة إلى المذكرة
id: Tambah ke Catatan

# addToNoteInfo
source: Add selected messages to an existing note?
ar: أضف الرسائل المحددة إلى مذكرة موجودة؟
id: Tambahkan pesan yang dipilih ke catatan yang sudah ada?

# copyMsg
source: Copy Message
ar: نسخ الرسالة
id: Salin Pesan

# exportMsg
source: Export Message
ar: تصدير الرسالة
id: Ekspor Pesan

# arabFont
source: Arabic Font
ar: خط عربي
id: Font Arab

# canAddMsgAgain
source: You can add this message again as long as the message still exists.
ar: يمكنك إضافة هذه الرسالة مرة أخرى طالما أن الرسالة ما زالت موجودة.
id: Anda dapat menambahkan pesan ini lagi selama pesan masih ada.
